let handler = async (m, { isPrems, conn }) => {
let time = global.db.data.users[m.sender].lastcofre + 0 // 36000000 10 Horas //86400000 24 Horas
if (new Date - global.db.data.users[m.sender].lastcofre < 0) throw `[❗𝐈𝐍𝐅𝐎❗] 𝚈𝙰 𝚁𝙴𝙲𝙻𝙰𝙼𝙰𝚂𝚃𝙴 𝚃𝚄 𝙲𝙾𝙵𝚁𝙴\𝚗𝚅𝚄𝙴𝙻𝚅𝙴 𝙴𝙽 *${msToTime(time - new Date())}* 𝙿𝙰𝚁𝙰 𝚅𝙾𝙻𝚅𝙴𝚁 𝙰 𝚁𝙴𝙲𝙻𝙰𝙼𝙰𝚁`
await m.react('💳')
let img = 'https://qu.ax/SeOfc.jpg' 
let texto = `𝙀𝙡𝙞𝙩𝙚𝘽𝙤𝙩𝙂𝙡𝙤𝙗𝙖𝙡 -

Creado en el año 2023/07/15
𝘕𝘰𝘮𝘪𝘯𝘢𝘥𝘰 𝘤𝘰𝘮𝘰 𝘦𝘭 𝘮𝘦𝘫𝘰𝘳 𝘣𝘰𝘵 𝘥𝘦 𝘓𝘢𝘵𝘪𝘯𝘰𝘢𝘮𝘦́𝘳𝘪𝘤𝘢, 𝘫𝘶𝘯𝘵𝘰 𝘢 𝘱𝘳𝘰𝘺𝘦𝘤𝘵𝘰𝘟 . 🏆

𝘚𝘰𝘮𝘰𝘴 𝘱𝘳𝘰𝘧𝘦𝘴𝘪𝘰𝘯𝘢𝘭𝘦𝘴 𝘤𝘰𝘯 𝘮𝘢́𝘴 𝘥𝘦 3 𝘢𝘯̃𝘰𝘴 𝘥𝘦 𝘦𝘹𝘱𝘦𝘳𝘪𝘦𝘯𝘤𝘪𝘢, 𝘦𝘯 𝘥𝘦𝘴𝘢𝘳𝘳𝘰𝘭𝘭𝘰 𝘥𝘦 𝘣𝘰𝘵𝘴 , 𝘱𝘢́𝘨𝘪𝘯𝘢𝘴 𝘸𝘦𝘣, 𝘯𝘰𝘥𝘰𝘴𝘝𝘪𝘱 𝘺 𝘮𝘶𝘤𝘩𝘰 𝘮𝘢́𝘴 . 

• 𝘌𝘭𝘪𝘵𝘦 𝘉𝘰𝘵 𝘎𝘭𝘰𝘣𝘢𝘭 // 𝘗𝘳𝘰𝘺𝘦𝘤𝘵𝘰 𝘟 , 𝘦𝘴𝘵𝘢́ 𝘤𝘳𝘦𝘢𝘥𝘰 𝘱𝘢𝘳𝘢 𝘤𝘶𝘮𝘱𝘭𝘪𝘳 𝘤𝘰𝘯 𝘵𝘶𝘴 𝘯𝘦𝘤𝘦𝘴𝘪𝘥𝘢𝘥𝘦𝘴 , 𝘨𝘦𝘴𝘵𝘪𝘰́𝘯 𝘦𝘯 𝘵𝘶 𝘨𝘳𝘶𝘱𝘰, 𝘦𝘯𝘵𝘳𝘦𝘵𝘦𝘯𝘪𝘮𝘪𝘦𝘯𝘵𝘰, 𝘥𝘦𝘴𝘤𝘢𝘳𝘨𝘢𝘴 , 𝘤𝘰𝘮𝘢𝘯𝘥𝘰𝘴 𝘥𝘦 𝘧𝘳𝘦𝘦 𝘧𝘪𝘳𝘦 𝘺 𝘵𝘰𝘥𝘰 𝘦𝘭 𝘮𝘶𝘯𝘥𝘰 𝘨𝘢𝘮𝘪𝘯𝘨 𝘺 𝘸𝘦𝘣.
𝘗𝘳𝘦𝘤𝘪𝘰𝘴 𝘢 𝘵𝘶 𝘢𝘭𝘤𝘢𝘯𝘤𝘦 𝘥𝘦 𝘵𝘶 𝘣𝘰𝘭𝘴𝘪𝘭𝘭𝘰 .
> "𝘙𝘦𝘤𝘶𝘦𝘳𝘥𝘢 , 𝘭𝘰 𝘣𝘢𝘳𝘢𝘵𝘰 𝘴𝘢𝘭𝘦 𝘤𝘢𝘳𝘰 🫰🏻"

💌 𝘚𝘪́𝘨𝘶𝘦𝘯𝘰𝘴 𝘱𝘢𝘳𝘢 𝘥𝘦𝘴𝘤𝘶𝘣𝘳𝘪𝘳 𝘭𝘢𝘴 𝘶́𝘭𝘵𝘪𝘮𝘢𝘴 𝘯𝘰𝘷𝘦𝘥𝘢𝘥𝘦𝘴 𝘥𝘦 𝘌𝘭𝘪𝘵𝘦𝘉𝘰𝘵𝘎𝘭𝘰𝘣𝘢𝘭 𝘺 𝘗𝘳𝘰𝘺𝘦𝘤𝘵𝘰𝘟 , 𝘦𝘹𝘱𝘭𝘰𝘳𝘦𝘮𝘰𝘴 𝘫𝘶𝘯𝘵𝘰𝘴 𝘦𝘯 𝘦𝘭 𝘮𝘶𝘯𝘥𝘰 𝘴𝘪𝘴𝘵𝘦𝘮𝘢́𝘵𝘪𝘤𝘰 𝘥𝘦 𝘭𝘰𝘴 𝘣𝘰𝘵𝘴

🔗 𝘾𝙖𝙣𝙖𝙡 :
» https://whatsapp.com/channel/0029Vatsbep84OmF6dDXpm1s

💳 𝙍𝙚𝙖𝙡𝙞𝙯𝙖 𝙚𝙡 𝙥𝙖𝙜𝙤́ 𝙚𝙣 :
𝙋𝙖𝙮𝙥𝙖𝙡: 
» https://www.paypal.me/KevinBustillos15
𝘽𝙖𝙣𝙘𝙤 𝙋𝙞𝙘𝙝𝙞𝙣𝙘𝙝𝙖 
» 2210286280

 © 2023 EliteBotGlobal // ProyectoX`

const fkontak = {
	"key": {
    "participants":"0@s.whatsapp.net",
		"remoteJid": "status@broadcast",
		"fromMe": false,
		"id": "Halo"
	},
	"message": {
		"contactMessage": {
			"vcard": `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD`
		}
	},
	"participant": "0@s.whatsapp.net"
}
await conn.sendFile(m.chat, img, 'img.jpg', texto, fkontak)
global.db.data.users[m.sender].lastcofre = new Date * 1
}
handler.command = ['comprar'] 
handler.register = false 
export default handler
